OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USBD/Driver_USBD_HSUSBD.c
/*
 * Copyright (c) 2013-2020 Arm Limited. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

/**************************************************************************//**
* @file     Driver_USBD_HSUSBD.c
* @version  V1.00
* @brief    HSUSBD driver for Nuvoton M55M1
*
* @copyright SPDX-License-Identifier: Apache-2.0
* @copyright Copyright (C) 2024 Nuvoton Technology Corp. All rights reserved.
******************************************************************************/

/*! \page Dirver_USBD HSUSBD

# Revision History

  - Initial release

# Requirements

This driver requires the M55M1 BSP.
The driver instance is mapped to hardware as shown in the table below:

  CMSIS Driver Instance | Hardware Resource
  :---------------------|:-----------------------
  Driver_USBD1          | HSUSBD0

*/


/* Project can define PRJ_RTE_DEVICE_HEADER macro to include private or global RTE_Device.h. */
#ifdef   PRJ_RTE_DEVICE_HEADER
    #include PRJ_RTE_DEVICE_HEADER
#else
    #include "RTE_Device/RTE_Device.h"
#endif

#include "Driver_USBD.h"
#include <string.h>
#include "NuMicro.h"

#define ARM_USBD_DRV_VERSION    ARM_DRIVER_VERSION_MAJOR_MINOR(1, 0) /* driver version */
/* Driver Version */
static const ARM_DRIVER_VERSION usbd_driver_version =
{
    ARM_USBD_API_VERSION,
    ARM_USBD_DRV_VERSION
};
// Compile-time configuration **************************************************

// Configuration depending on RTE_Device_USBD.h
// Check if at least one peripheral instance is configured in RTE_Device_USBD.h
#if    (!(RTE_USBD1))
    //#warning USB Device driver requires at least one USB (Device) peripheral configured in RTE_USBD.h
#else
    #define DRIVER_CONFIG_VALID             1
#endif

// Compile-time configuration (that can be externally overridden if necessary)
// Maximum number of endpoints
#ifndef USBD_MAX_ENDPOINT_NUM
    #define USBD_MAX_ENDPOINT_NUM           (HSUSBD_MAX_EP)
#endif

// Maximum packet size for Endpoint 0
#ifndef USBD_EP0_MAX_PACKET_SIZE
    #define USBD_EP0_MAX_PACKET_SIZE        (64)
#endif

// Maximum RAM for endpoint buffers
#ifndef USBD_BUF_SIZE
    #define USBD_BUF_SIZE                   (8192)
#endif

// *****************************************************************************

#ifdef  DRIVER_CONFIG_VALID     // Driver code is available only if configuration is valid

// Macros
#define USBD_t          HSUSBD_T
#define USBD_EP_t       HSUSBD_EP_T
// Macro for section for RW info
#ifdef  USBD_SECTION_NAME
    #define USBDn_SECTION_(name,n)  __attribute__((section(name #n)))
    #define USBDn_SECTION(n)        USBDn_SECTION_(USBD_SECTION_NAME,n)
#else
    #define USBDn_SECTION(n)
#endif

// Macro for declaring functions (for instances)
#define FUNCS_DECLARE(n)                                                                                                   \
    static  ARM_USBD_CAPABILITIES   USBD##n##_GetCapabilities           (void);                                            \
    static  int32_t                 USBD##n##_Initialize                (ARM_USBD_SignalDeviceEvent_t   cb_device_event,   \
                                                                         ARM_USBD_SignalEndpointEvent_t cb_endpoint_event);\
    static  int32_t                 USBD##n##_Uninitialize              (void);                                            \
    static  int32_t                 USBD##n##_PowerControl              (ARM_POWER_STATE state);                           \
    static  int32_t                 USBD##n##_DeviceConnect             (void);                                            \
    static  int32_t                 USBD##n##_DeviceDisconnect          (void);                                            \
    static  ARM_USBD_STATE          USBD##n##_DeviceGetState            (void);                                            \
    static  int32_t                 USBD##n##_DeviceRemoteWakeup        (void);                                            \
    static  int32_t                 USBD##n##_DeviceSetAddress          (uint8_t  dev_addr);                               \
    static  int32_t                 USBD##n##_ReadSetupPacket           (uint8_t *setup);                                  \
    static  int32_t                 USBD##n##_EndpointConfigure         (uint8_t  ep_addr,                                 \
                                                                         uint8_t  ep_type,                                 \
                                                                         uint16_t ep_max_packet_size);                     \
    static  int32_t                 USBD##n##_EndpointUnconfigure       (uint8_t  ep_addr);                                \
    static  int32_t                 USBD##n##_EndpointStall             (uint8_t  ep_addr, bool stall);                    \
    static  int32_t                 USBD##n##_EndpointTransfer          (uint8_t  ep_addr,                                 \
                                                                         uint8_t *data,                                    \
                                                                         uint32_t num);                                    \
    static  uint32_t                USBD##n##_EndpointTransferGetResult (uint8_t  ep_addr);                                \
    static  int32_t                 USBD##n##_EndpointTransferAbort     (uint8_t  ep_addr);                                \
    static  uint16_t                USBD##n##_GetFrameNumber            (void);

