OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USBD/Driver_USBD_HSUSBD.c
// Macro for defining functions (for instances)
#define FUNCS_DEFINE(n)                                                                                                                                                                                                        \
    static  ARM_USBD_CAPABILITIES   USBD##n##_GetCapabilities           (void)                                             { return USBDn_GetCapabilities           (&usbd##n##_info); }                                       \
    static  int32_t                 USBD##n##_Initialize                (ARM_USBD_SignalDeviceEvent_t   cb_device_event,                                                                                                       \
                                                                         ARM_USBD_SignalEndpointEvent_t cb_endpoint_event) { return USBDn_Initialize                (&usbd##n##_info, cb_device_event, cb_endpoint_event); }   \
    static  int32_t                 USBD##n##_Uninitialize              (void)                                             { return USBDn_Uninitialize              (&usbd##n##_info); }                                       \
    static  int32_t                 USBD##n##_PowerControl              (ARM_POWER_STATE state)                            { return USBDn_PowerControl              (&usbd##n##_info, state); }                                \
    static  int32_t                 USBD##n##_DeviceConnect             (void)                                             { return USBDn_DeviceConnect             (&usbd##n##_info); }                                       \
    static  int32_t                 USBD##n##_DeviceDisconnect          (void)                                             { return USBDn_DeviceDisconnect          (&usbd##n##_info); }                                       \
    static  ARM_USBD_STATE          USBD##n##_DeviceGetState            (void)                                             { return USBDn_DeviceGetState            (&usbd##n##_info); }                                       \
    static  int32_t                 USBD##n##_DeviceRemoteWakeup        (void)                                             { return USBDn_DeviceRemoteWakeup        (&usbd##n##_info); }                                       \
    static  int32_t                 USBD##n##_DeviceSetAddress          (uint8_t  dev_addr)                                { return USBDn_DeviceSetAddress          (&usbd##n##_info, dev_addr); }                             \
    static  int32_t                 USBD##n##_ReadSetupPacket           (uint8_t *setup)                                   { return USBDn_ReadSetupPacket           (&usbd##n##_info, setup); }                                \
    static  int32_t                 USBD##n##_EndpointConfigure         (uint8_t  ep_addr,                                                                                                                                     \
                                                                         uint8_t  ep_type,                                                                                                                                     \
                                                                         uint16_t ep_max_packet_size)                      { return USBDn_EndpointConfigure         (&usbd##n##_info, ep_addr, ep_type, ep_max_packet_size); } \
    static  int32_t                 USBD##n##_EndpointUnconfigure       (uint8_t  ep_addr)                                 { return USBDn_EndpointUnconfigure       (&usbd##n##_info, ep_addr); }                              \
    static  int32_t                 USBD##n##_EndpointStall             (uint8_t  ep_addr, bool stall)                     { return USBDn_EndpointStall             (&usbd##n##_info, ep_addr, stall); }                       \
    static  int32_t                 USBD##n##_EndpointTransfer          (uint8_t  ep_addr,                                                                                                                                     \
                                                                         uint8_t *data,                                                                                                                                        \
                                                                         uint32_t num)                                     { return USBDn_EndpointTransfer          (&usbd##n##_info, ep_addr, data, num); }                   \
    static  uint32_t                USBD##n##_EndpointTransferGetResult (uint8_t  ep_addr)                                 { return USBDn_EndpointTransferGetResult (&usbd##n##_info, ep_addr); }                              \
    static  int32_t                 USBD##n##_EndpointTransferAbort     (uint8_t  ep_addr)                                 { return USBDn_EndpointTransferAbort     (&usbd##n##_info, ep_addr); }                              \
    static  uint16_t                USBD##n##_GetFrameNumber            (void)                                             { return USBDn_GetFrameNumber            (&usbd##n##_info); }
// Macro for defining driver structures (for instances)
#define USBD_DRIVER(n)                  \
    ARM_DRIVER_USBD Driver_USBD##n = {    \
                                          USBD_GetVersion,                      \
                                          USBD##n##_GetCapabilities,            \
                                          USBD##n##_Initialize,                 \
                                          USBD##n##_Uninitialize,               \
                                          USBD##n##_PowerControl,               \
                                          USBD##n##_DeviceConnect,              \
                                          USBD##n##_DeviceDisconnect,           \
                                          USBD##n##_DeviceGetState,             \
                                          USBD##n##_DeviceRemoteWakeup,         \
                                          USBD##n##_DeviceSetAddress,           \
                                          USBD##n##_ReadSetupPacket,            \
                                          USBD##n##_EndpointConfigure,          \
                                          USBD##n##_EndpointUnconfigure,        \
                                          USBD##n##_EndpointStall,              \
                                          USBD##n##_EndpointTransfer,           \
                                          USBD##n##_EndpointTransferGetResult,  \
                                          USBD##n##_EndpointTransferAbort,      \
                                          USBD##n##_GetFrameNumber              \
                                     };

// Endpoint related macros
#define EP_OUT_INDEX            (0U)
#define EP_IN_INDEX             (1U)
#define EP_DIR(ep_addr)         (((ep_addr) >> 7) & 1U)
#define EP_NUM(ep_addr)         (ep_addr & ARM_USB_ENDPOINT_NUMBER_MASK)

