OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USBD/Driver_USBD_HSUSBD.c
static USBD_EP_t *USBD_EndpointEntry(const USBD_Info_t *const ptr_usbd_info, uint8_t ep_addr, bool add)
{
    EP_Num_t ep_index;
    EP_Info_t *ptr_ep;
    USBD_t *husbd = ptr_usbd_info->ptr_ro_info->ptr_USBD;
    USBD_EP_t *ep;

    for (ep_index = PERIPH_EPA, ptr_ep = &ptr_usbd_info->ptr_rw_info->ep_info[PERIPH_EPA], ep = husbd->EP;
            ep_index < PERIPH_MAX_EP;
            ep_index++, ptr_ep++, ep++)
    {
        if (add)
        {
            if (0 == (ep->EPCFG & HSUSBD_EPCFG_EPEN_Msk)) return ep;
        }
        else
        {
            if (ptr_ep->ep_addr == ep_addr) return ep;
        }
    }

    return NULL;
}

/**
  \fn          USBD_WriteEpBuffer(uint32_t u32EpDat[], uint8_t u8Src[], uint32_t num)
  \brief       Write data into the USB endpoint buffer (IN transaction).
  \detail      This function writes data from a source buffer into the USB endpoint data(DAT) buffer.
  \param[out]  u32EpDat   Pointer to the endpoint DAT register (Endpoint Data Buffer).
  \param[in]   u8Src      Pointer to the source data buffer in system memory.
  \param[in]   num        Number of bytes to read from the endpoint buffer.
*/
void USBD_WriteEpBuffer(uint32_t u32EpDat[], uint8_t u8Src[], uint32_t num)
{
    uint32_t i = 0;

    for (; i + 4 <= num; i += 4, u8Src += 4)
        outpw(u32EpDat, *((uint32_t *)u8Src));

    for (; i < num; i++)
        outpb(u32EpDat, *u8Src++);
}

/**
  \fn          USBD_ReadEpBuffer(uint8_t u8Dst[], uint32_t u32EpDat[], uint32_t num)
  \brief       Read data from the USB endpoint buffer (OUT transaction).
  \detail      This function reads data from a USB endpoint data buffer(DAT) into a destination buffer.
  \param[out]  u8Dst      Pointer to the destination buffer in system memory.
  \param[in]   u32EpDat   Pointer to the endpoint DAT register (Endpoint Data Buffer).
  \param[in]   num        Number of bytes to read from the endpoint buffer.
*/

void USBD_ReadEpBuffer(uint8_t u8Dst[], uint32_t u32EpDat[], uint32_t num)
{
    uint32_t i = 0;

    for (; i + 4 <= num; i += 4, u8Dst += 4)
        * ((uint32_t *)u8Dst) = inpw(u32EpDat);

    for (; i < num; i++)
        *u8Dst++ = inpb(u32EpDat);
}

/**
  \fn          void USBD_EndpointConfigureBuffer (const USBD_Info_t *const ptr_usbd_info)
  \brief       Configure and reassign USB endpoint buffer addresses in USB SRAM.
  \detail      This function resets the buffer allocation pointer and reconfigures the buffer segmentation for all enabled endpoints.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
*/
static void USBD_EndpointConfigureBuffer(const USBD_Info_t *const ptr_usbd_info)
{
    // USB RAM beyond what we've allocated above is available to the user(Control endpoint used.)
    ptr_usbd_info->ptr_rw_info->bufseg_addr = USBD_EP0_MAX_PACKET_SIZE;

    // Reconfigures the buffer segmentation for all enabled endpoints.
    EP_Num_t ep_index;
    USBD_EP_t *ep;

    for (ep_index = PERIPH_EPA, ep = &ptr_usbd_info->ptr_ro_info->ptr_USBD->EP[PERIPH_EPA]; ep_index < PERIPH_MAX_EP; ep_index++, ep++)
    {
        if (0 == (ep->EPCFG & HSUSBD_EPCFG_EPEN_Msk)) continue;

        // Update the Endpoint Buffer Segmentation
        ep->EPBUFSTART = ptr_usbd_info->ptr_rw_info->bufseg_addr;
        ep->EPBUFEND = ptr_usbd_info->ptr_rw_info->bufseg_addr + ptr_usbd_info->ptr_rw_info->ep_info[ep_index].max_packet_size - 1U;
        ptr_usbd_info->ptr_rw_info->bufseg_addr += ptr_usbd_info->ptr_rw_info->ep_info[ep_index].max_packet_size;
        // Set endpoint payload
        ep->EPMPS = ptr_usbd_info->ptr_rw_info->ep_info[ep_index].max_packet_size;
    }
}

// Driver functions ************************************************************

/**
  \fn          ARM_DRIVER_VERSION USBD_GetVersion (void)
  \brief       Get driver version.
  \return      \ref ARM_DRIVER_VERSION
*/
static ARM_DRIVER_VERSION USBD_GetVersion(void)
{
    return usbd_driver_version;
}

/**
  \fn          ARM_USBD_CAPABILITIES USBDn_GetCapabilities (const USBD_Info_t * const ptr_usbd_info)
  \brief       Get driver capabilities.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
  \return      \ref ARM_USBD_CAPABILITIES
*/
static ARM_USBD_CAPABILITIES USBDn_GetCapabilities(const USBD_Info_t *const ptr_usbd_info)
{
    ARM_USBD_CAPABILITIES driver_capabilities;

    (void)ptr_usbd_info;
    // Clear capabilities structure
    memset(&driver_capabilities, 0, sizeof(ARM_USBD_CAPABILITIES));

    // If VBUS detection is available
    driver_capabilities.vbus_detection = 1U;
    driver_capabilities.event_vbus_on  = 1U;
    driver_capabilities.event_vbus_off = 1U;

    return driver_capabilities;
}

/**
  \fn          int32_t USBDn_Initialize (const USBD_Info_t * const      ptr_usbd_info,
                                         ARM_USBD_SignalDeviceEvent_t   cb_device_event,
                                         ARM_USBD_SignalEndpointEvent_t cb_endpoint_event)
  \brief       Initialize USB Device Interface.
  \param[in]   ptr_usbd_info      Pointer to USBD info structure (USBD_Info_t)
  \param[in]   cb_device_event    Pointer to \ref ARM_USBD_SignalDeviceEvent
  \param[in]   cb_endpoint_event  Pointer to \ref ARM_USBD_SignalEndpointEvent
  \return      \ref execution_status
*/
static int32_t USBDn_Initialize(const USBD_Info_t *const ptr_usbd_info, ARM_USBD_SignalDeviceEvent_t cb_device_event,
                                ARM_USBD_SignalEndpointEvent_t cb_endpoint_event)
{
    // Clear run-time info
    memset((void *)ptr_usbd_info->ptr_rw_info, 0, sizeof(RW_Info_t));

    // Register callback functions
    ptr_usbd_info->ptr_rw_info->cb_device_event   = cb_device_event;
    ptr_usbd_info->ptr_rw_info->cb_endpoint_event = cb_endpoint_event;
    // Set driver status to initialized
    ptr_usbd_info->ptr_rw_info->drv_status.initialized = 1U;

    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBDn_Uninitialize (const USBD_Info_t * const ptr_usbd_info)
  \brief       De-initialize USB Device Interface.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
  \return      \ref execution_status
*/
static int32_t USBDn_Uninitialize(const USBD_Info_t *const ptr_usbd_info)
{
    if (ptr_usbd_info->ptr_rw_info->drv_status.powered != 0U)
    {
        // If peripheral is powered, power off the peripheral
        (void)USBDn_PowerControl(ptr_usbd_info, ARM_POWER_OFF);
    }

    // Clear run-time info
    memset((void *)ptr_usbd_info->ptr_rw_info, 0, sizeof(RW_Info_t));

    return ARM_DRIVER_OK;
}

static int32_t USBDn_PowerControl(const USBD_Info_t *const ptr_usbd_info, ARM_POWER_STATE state)
{
    ARM_USBD_SignalDeviceEvent_t   cb_device_event;
    ARM_USBD_SignalEndpointEvent_t cb_endpoint_event;
    DriverStatus_t                 drv_status;
    USBD_t *husbd = ptr_usbd_info->ptr_ro_info->ptr_USBD;

    switch (state)
    {
        case ARM_POWER_FULL:
            if (ptr_usbd_info->ptr_rw_info->drv_status.initialized == 0U)
            {
                return ARM_DRIVER_ERROR;
            }

            // Store variables we need to preserve
            cb_device_event   = ptr_usbd_info->ptr_rw_info->cb_device_event;
            cb_endpoint_event = ptr_usbd_info->ptr_rw_info->cb_endpoint_event;
            drv_status        = ptr_usbd_info->ptr_rw_info->drv_status;

            // Clear run-time info
            memset((void *)ptr_usbd_info->ptr_rw_info, 0, sizeof(RW_Info_t));

            // Restore variables we wanted to preserve
            ptr_usbd_info->ptr_rw_info->cb_device_event   = cb_device_event;
            ptr_usbd_info->ptr_rw_info->cb_endpoint_event = cb_endpoint_event;
            ptr_usbd_info->ptr_rw_info->drv_status        = drv_status;

            // Set driver status to powered
            ptr_usbd_info->ptr_rw_info->drv_status.powered = 1U;

            uint32_t u32TimeOutCnt = SystemCoreClock;
            // Initial USB engine
            husbd->PHYCTL |= HSUSBD_PHYCTL_PHYEN_Msk;

            // wait PHY clock ready
            while (!(husbd->PHYCTL & HSUSBD_PHYCTL_PHYCLKSTB_Msk))
            {
                if (--u32TimeOutCnt == 0) return ARM_DRIVER_ERROR_TIMEOUT;
            }

            NVIC_EnableIRQ(ptr_usbd_info->ptr_ro_info->irq_n);

            // Enable USB BUS, CEP and EPA-R global interrupt
            husbd->GINTEN = enabled_irqs;
            // Enable BUS interrupt
            husbd->BUSINTEN = HSUSBD_BUSINTEN_DMADONEIEN_Msk | HSUSBD_BUSINTEN_RESUMEIEN_Msk | HSUSBD_BUSINTEN_RSTIEN_Msk | HSUSBD_BUSINTEN_VBUSDETIEN_Msk;
            // USB High-speed initiate a chirp-sequence
            husbd->OPER = HSUSBD_OPER_HISPDEN_Msk;

            break;

        case ARM_POWER_OFF:

            for (EP_Num_t ep_index = PERIPH_EPA; ep_index < PERIPH_MAX_EP; ep_index++)
            {
                husbd->EP[ep_index].EPCFG = 0;
            }

