OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USBD/Driver_USBD_HSUSBD.c
            NVIC_DisableIRQ(ptr_usbd_info->ptr_ro_info->irq_n);

            // Set driver status to not powered
            ptr_usbd_info->ptr_rw_info->drv_status.powered = 0U;

            // Store variables we need to preserve
            cb_device_event   = ptr_usbd_info->ptr_rw_info->cb_device_event;
            cb_endpoint_event = ptr_usbd_info->ptr_rw_info->cb_endpoint_event;
            drv_status        = ptr_usbd_info->ptr_rw_info->drv_status;

            // Clear run-time info
            memset((void *)ptr_usbd_info->ptr_rw_info, 0, sizeof(RW_Info_t));

            // Restore variables we wanted to preserve
            ptr_usbd_info->ptr_rw_info->cb_device_event   = cb_device_event;
            ptr_usbd_info->ptr_rw_info->cb_endpoint_event = cb_endpoint_event;
            ptr_usbd_info->ptr_rw_info->drv_status        = drv_status;
            break;

        case ARM_POWER_LOW:
            return ARM_DRIVER_ERROR_UNSUPPORTED;

        default:
            return ARM_DRIVER_ERROR_PARAMETER;
    }

    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBDn_DeviceConnect (const USBD_Info_t * const ptr_usbd_info)
  \brief       Connect USB Device.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
  \return      \ref execution_status
*/
static int32_t USBDn_DeviceConnect(const USBD_Info_t *const ptr_usbd_info)
{
    if (ptr_usbd_info->ptr_rw_info->drv_status.powered == 0U)
    {
        return ARM_DRIVER_ERROR;
    }

    // Pull D+ high to let the host detect a Full-Speed device and complete the connection.
    ptr_usbd_info->ptr_ro_info->ptr_USBD->PHYCTL |= HSUSBD_PHYCTL_DPPUEN_Msk;

    if (ptr_usbd_info->ptr_ro_info->ptr_USBD->OPER & HSUSBD_OPER_HISPDEN_Msk)
        ptr_usbd_info->ptr_ro_info->ptr_USBD->OPER |= HSUSBD_OPER_HISHSEN_Msk;

    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBDn_DeviceDisconnect (const USBD_Info_t * const ptr_usbd_info)
  \brief       Disconnect USB Device.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
  \return      \ref execution_status
*/
static int32_t USBDn_DeviceDisconnect(const USBD_Info_t *const ptr_usbd_info)
{
    if (ptr_usbd_info->ptr_rw_info->drv_status.powered == 0U)
    {
        return ARM_DRIVER_ERROR;
    }

    // To simulate a disconnection, the pull-up is disabled to create a Single-Ended Zero (SE0) condition.
    ptr_usbd_info->ptr_ro_info->ptr_USBD->PHYCTL &= ~HSUSBD_PHYCTL_DPPUEN_Msk;
    return ARM_DRIVER_OK;
}

/**
  \fn          ARM_USBD_STATE USBDn_DeviceGetState (const USBD_Info_t * const ptr_usbd_info)
  \brief       Get current USB Device State.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
  \return      Device State \ref ARM_USBD_STATE
*/
static ARM_USBD_STATE USBDn_DeviceGetState(const USBD_Info_t *const ptr_usbd_info)
{
    ARM_USBD_STATE state;
    // Clear state structure
    memset(&state, 0, sizeof(ARM_USBD_STATE));

    // Process additionally handled communication information
    if (ptr_usbd_info->ptr_rw_info->usbd_state.vbus != 0U)
    {
        state.vbus = 1U;
    }

    switch (ptr_usbd_info->ptr_rw_info->usbd_state.speed)
    {
        case ARM_USB_SPEED_FULL:
            state.speed = ARM_USB_SPEED_FULL;
            break;

        case ARM_USB_SPEED_HIGH:
            state.speed = ARM_USB_SPEED_HIGH;
            break;

        default:
            break;
    }

    if (ptr_usbd_info->ptr_rw_info->usbd_state.active != 0U)
    {
        state.active = 1U;
    }

    return state;
}

/**
  \fn          int32_t USBDn_DeviceRemoteWakeup (const USBD_Info_t * const ptr_usbd_info)
  \brief       Trigger USB Remote Wakeup.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
  \return      \ref execution_status
*/
static int32_t USBDn_DeviceRemoteWakeup(const USBD_Info_t *const ptr_usbd_info)
{
    if (ptr_usbd_info->ptr_rw_info->drv_status.powered == 0U)
    {
        return ARM_DRIVER_ERROR;
    }

    ptr_usbd_info->ptr_ro_info->ptr_USBD->OPER |= HSUSBD_OPER_RESUMEEN_Msk;

    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBDn_DeviceSetAddress (const USBD_Info_t * const ptr_usbd_info, uint8_t dev_addr)
  \brief       Set USB Device Address.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
  \param[in]   dev_addr  Device Address
  \return      \ref execution_status
*/
static int32_t USBDn_DeviceSetAddress(const USBD_Info_t *const ptr_usbd_info, uint8_t dev_addr)
{
    if (ptr_usbd_info->ptr_rw_info->drv_status.powered == 0U)
    {
        return ARM_DRIVER_ERROR;
    }

    ptr_usbd_info->ptr_ro_info->ptr_USBD->FADDR = dev_addr;

    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBDn_ReadSetupPacket (const USBD_Info_t * const ptr_usbd_info, uint8_t *setup)
  \brief       Read setup packet received over Control Endpoint.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
  \param[out]  setup  Pointer to buffer for setup packet
  \return      \ref execution_status
*/
static int32_t USBDn_ReadSetupPacket(const USBD_Info_t *const ptr_usbd_info, uint8_t *setup)
{
    if (ptr_usbd_info->ptr_rw_info->drv_status.powered == 0U)
    {
        return ARM_DRIVER_ERROR;
    }

    if (ptr_usbd_info->ptr_rw_info->setup_received == 0U)
    {
        return ARM_DRIVER_ERROR;
    }

    do
    {
        ptr_usbd_info->ptr_rw_info->setup_received = 0U;
        memcpy((uint8_t *)setup, (uint8_t *)ptr_usbd_info->ptr_rw_info->setup_packet, 8U);
    } while (ptr_usbd_info->ptr_rw_info->setup_received != 0U);

    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBDn_EndpointConfigure (const USBD_Info_t * const ptr_usbd_info,
                                                      uint8_t           ep_addr,
                                                      uint8_t           ep_type,
                                                      uint16_t          ep_max_packet_size)
  \brief       Configure USB Endpoint.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \param[in]   ep_type  Endpoint Type (ARM_USB_ENDPOINT_xxx)
  \param[in]   ep_max_packet_size Endpoint Maximum Packet Size
  \return      \ref execution_status
*/
static int32_t USBDn_EndpointConfigure(const USBD_Info_t *const ptr_usbd_info, uint8_t  ep_addr,
                                       uint8_t  ep_type,
                                       uint16_t ep_max_packet_size)
{
    EP_Info_t *ptr_ep;
    uint32_t   ep_dir_mask, ep_type_mask;
    uint8_t    ep_num = EP_NUM(ep_addr);
    uint8_t    ep_dir = EP_DIR(ep_addr);

    // Unconfigure Endpoint
    USBDn_EndpointUnconfigure(ptr_usbd_info, ep_addr);

    if (ep_num != 0)
    {
        USBD_EP_t *ep = USBD_EndpointEntry(ptr_usbd_info, ep_addr, true);
        ptr_ep = &ptr_usbd_info->ptr_rw_info->ep_info[ep - ptr_usbd_info->ptr_ro_info->ptr_USBD->EP];

        // Check buffer limit when opening a new endpoint
        if (ptr_usbd_info->ptr_rw_info->bufseg_addr + ep_max_packet_size > USBD_BUF_SIZE)
        {
            return ARM_DRIVER_ERROR;
        }

