OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USBD/Driver_USBD_HSUSBD.c
            if (ptr_ep->num)
            {
                uint32_t u32TimeOutCnt = SystemCoreClock >> 2;

                while (ptr_ep->num < (husbd->CEPRXCNT & HSUSBD_CEPRXCNT_RXCNT_Msk))
                    if (--u32TimeOutCnt == 0) break;

                USBD_ReadEpBuffer(ptr_ep->data, (uint32_t *)&husbd->CEPDAT, ptr_ep->num);
                ptr_ep->num_transferred_total += ptr_ep->num;
            }

            if ((ptr_ep->num_transferred_total < ptr_ep->max_packet_size) || (ptr_ep->num_transferred_total == ptr_ep->num))
            {
                ptr_usbd_info->ptr_rw_info->cb_endpoint_event(0x00U, ARM_USBD_EVENT_OUT);
            }
        }
    }

    return ARM_DRIVER_OK;
}

/**
  \fn          uint32_t USBDn_EndpointTransferGetResult (const USBD_Info_t * const ptr_usbd_info, uint8_t ep_addr)
  \brief       Get result of USB Endpoint transfer.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \return      number of successfully transferred data bytes
*/
static uint32_t USBDn_EndpointTransferGetResult(const USBD_Info_t *const ptr_usbd_info, uint8_t ep_addr)
{
    if (ptr_usbd_info->ptr_rw_info->drv_status.powered == 0U)
    {
        return 0U;
    }

    EP_Info_t *ptr_ep;

    if (EP_NUM(ep_addr) != 0)
    {
        USBD_EP_t *ep = USBD_EndpointEntry(ptr_usbd_info, ep_addr, false);
        uint8_t   periph_epnum = ep - ptr_usbd_info->ptr_ro_info->ptr_USBD->EP;
        ptr_ep = &ptr_usbd_info->ptr_rw_info->ep_info[periph_epnum];

        if (periph_epnum >= USBD_MAX_ENDPOINT_NUM)
        {
            return 0U;
        }
    }
    else
    {
        ptr_ep = &ptr_usbd_info->ptr_rw_info->cep_info[EP_DIR(ep_addr)];
    }

    return ptr_ep->num_transferred_total;
}

static int32_t USBDn_EndpointTransferAbort(const USBD_Info_t *const ptr_usbd_info, uint8_t ep_addr)
{
    // Reset DMA
    ptr_usbd_info->ptr_ro_info->ptr_USBD->DMACNT = 0U;
    ptr_usbd_info->ptr_ro_info->ptr_USBD->DMACTL = HSUSBD_DMACTL_DMARST_Msk;
    ptr_usbd_info->ptr_ro_info->ptr_USBD->DMACTL = 0U;

    if (EP_NUM(ep_addr) != 0U)
    {
        USBD_EP_t *ep = USBD_EndpointEntry(ptr_usbd_info, ep_addr, false);
        ep->EPRSPCTL |= HSUSBD_EPRSPCTL_FLUSH_Msk;
    }
    else
    {
        ptr_usbd_info->ptr_ro_info->ptr_USBD->CEPCTL |= HSUSBD_CEPCTL_FLUSH_Msk;
    }

    return ARM_DRIVER_OK;
}

/**
  \fn          uint16_t USBDn_GetFrameNumber (const USBD_Info_t * const ptr_usbd_info)
  \brief       Get current USB Frame Number.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
  \return      Frame Number
*/
static uint16_t USBDn_GetFrameNumber(const USBD_Info_t *const ptr_usbd_info)
{
    return ((ptr_usbd_info->ptr_ro_info->ptr_USBD->FRAMECNT & HSUSBD_FRAMECNT_FRAMECNT_Msk) >> HSUSBD_FRAMECNT_FRAMECNT_Pos);
}

// Event functions *****************************************************************
/**
  \fn          void USBD_DataOutStage(const USBD_Info_t *const ptr_usbd_info, uint8_t ep_addr)
  \brief       Data OUT stage.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
*/
static void USBD_DataOutStage(const USBD_Info_t *const ptr_usbd_info, uint8_t ep_addr)
{
    EP_Info_t *ptr_ep;
    uint32_t   num_transferred;
    USBD_EP_t *ep;

    ep = USBD_EndpointEntry(ptr_usbd_info, ep_addr, false);
    ptr_ep = &ptr_usbd_info->ptr_rw_info->ep_info[ep - ptr_usbd_info->ptr_ro_info->ptr_USBD->EP];

    num_transferred = ep->EPDATCNT & HSUSBD_EPDATCNT_DATCNT_Msk;
    ptr_ep->num_transferred_total += num_transferred;

    USBD_ReadEpBuffer((uint8_t *)ptr_ep->data, (uint32_t *)&ep->EPDAT, num_transferred);

    if ((ptr_usbd_info->ptr_rw_info->cb_endpoint_event != NULL))
    {
        ptr_usbd_info->ptr_rw_info->cb_endpoint_event(ep_addr, ARM_USBD_EVENT_OUT);
    }
}

/**
  \fn          void USBD_DataInStage(const USBD_Info_t *const ptr_usbd_info, uint8_t ep_addr)
  \brief       Data IN stage.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
*/
static void USBD_DataInStage(const USBD_Info_t *const ptr_usbd_info, uint8_t ep_addr)
{
    EP_Info_t *ptr_ep;
    uint32_t   num_to_transfer;
    uint8_t   *data_to_transfer;
    USBD_EP_t *ep;

    ep = USBD_EndpointEntry(ptr_usbd_info, ep_addr, false);
    ptr_ep = &ptr_usbd_info->ptr_rw_info->ep_info[ep - ptr_usbd_info->ptr_ro_info->ptr_USBD->EP];


    // If there is more data to transfer
    data_to_transfer = ptr_ep->data + ptr_ep->num_transferred_total;
    num_to_transfer  = ptr_ep->num - ptr_ep->num_transferred_total;

    if (num_to_transfer > ptr_ep->max_packet_size)
    {
        num_to_transfer = ptr_ep->max_packet_size;
    }

    // Update transferred number
    ptr_ep->num_transferred_total += num_to_transfer;

    if (ptr_ep->num_transferred_total == ptr_ep->num)
    {
        ep->EPINTSTS = HSUSBD_EPINTSTS_TXPKIF_Msk;
        ep->EPINTEN = HSUSBD_EPINTEN_TXPKIEN_Msk;
    }

    USBD_WriteEpBuffer((uint32_t *)&ep->EPDAT, (uint8_t *)data_to_transfer, num_to_transfer);

    if (num_to_transfer != ptr_ep->max_packet_size) ep->EPRSPCTL = HSUSBD_EPRSPCTL_SHORTTXEN_Msk;

}

/**
  \fn          USBD_SetupStage(const USBD_Info_t *const ptr_usbd_info)
  \brief       Setup stage.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
  */
static void USBD_SetupStage(const USBD_Info_t *const ptr_usbd_info)
{
    ptr_usbd_info->ptr_rw_info->setup_packet[0] = (uint8_t)((ptr_usbd_info->ptr_ro_info->ptr_USBD->SETUP1_0 >> 0) & 0xFF);
    ptr_usbd_info->ptr_rw_info->setup_packet[1] = (uint8_t)((ptr_usbd_info->ptr_ro_info->ptr_USBD->SETUP1_0 >> 8) & 0xFF);
    ptr_usbd_info->ptr_rw_info->setup_packet[2] = (uint8_t)((ptr_usbd_info->ptr_ro_info->ptr_USBD->SETUP3_2 >> 0) & 0xFF);
    ptr_usbd_info->ptr_rw_info->setup_packet[3] = (uint8_t)((ptr_usbd_info->ptr_ro_info->ptr_USBD->SETUP3_2 >> 8) & 0xFF);
    ptr_usbd_info->ptr_rw_info->setup_packet[4] = (uint8_t)((ptr_usbd_info->ptr_ro_info->ptr_USBD->SETUP5_4 >> 0) & 0xFF);
    ptr_usbd_info->ptr_rw_info->setup_packet[5] = (uint8_t)((ptr_usbd_info->ptr_ro_info->ptr_USBD->SETUP5_4 >> 8) & 0xFF);
    ptr_usbd_info->ptr_rw_info->setup_packet[6] = (uint8_t)((ptr_usbd_info->ptr_ro_info->ptr_USBD->SETUP7_6 >> 0) & 0xFF);
    ptr_usbd_info->ptr_rw_info->setup_packet[7] = (uint8_t)((ptr_usbd_info->ptr_ro_info->ptr_USBD->SETUP7_6 >> 8) & 0xFF);

    ptr_usbd_info->ptr_rw_info->setup_received = 1U;

    if (ptr_usbd_info->ptr_rw_info->cb_endpoint_event != NULL)
    {
        ptr_usbd_info->ptr_rw_info->cb_endpoint_event(0x00U, ARM_USBD_EVENT_SETUP);
    }
}

/**
  \fn          void USBD_BusReset (const USBD_Info_t *const ptr_usbd_info)
  \brief       USBD Bus Reset.
  \param[in]   ptr_usbd_info    Pointer to USBD info structure (USBD_Info_t)
  */
static void USBD_BusReset(const USBD_Info_t *const ptr_usbd_info)
{
    USBD_t *husbd = ptr_usbd_info->ptr_ro_info->ptr_USBD;
    // Clear Endpoints information
    memset((void *)ptr_usbd_info->ptr_rw_info->ep_info, 0U, USBD_MAX_ENDPOINT_NUM * sizeof(EP_Info_t));
    memset((void *)ptr_usbd_info->ptr_rw_info->cep_info, 0U, 2 * sizeof(EP_Info_t));

