OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USBD/Driver_USBD_HSUSBD.c
    // Reset USBD state information
    ptr_usbd_info->ptr_rw_info->usbd_state.speed  = ARM_USB_SPEED_FULL;
    ptr_usbd_info->ptr_rw_info->usbd_state.active = 0U;

    if (ptr_usbd_info->ptr_rw_info->cb_device_event != NULL)
    {
        ptr_usbd_info->ptr_rw_info->cb_device_event(ARM_USBD_EVENT_RESET);
    }

    // Reset DMA
    ptr_usbd_info->ptr_ro_info->ptr_USBD->DMACNT = 0U;
    ptr_usbd_info->ptr_ro_info->ptr_USBD->DMACTL = HSUSBD_DMACTL_DMARST_Msk;
    ptr_usbd_info->ptr_ro_info->ptr_USBD->DMACTL = 0U;

    for (EP_Num_t ep_index = PERIPH_EPA; ep_index < PERIPH_MAX_EP; ep_index++)
    {
        ptr_usbd_info->ptr_ro_info->ptr_USBD->EP[ep_index].EPCFG = 0U;
    }

    // Buffer for control endpoint.
    husbd->CEPBUFSTART = 0U;
    husbd->CEPBUFEND = USBD_EP0_MAX_PACKET_SIZE - 1U;

    // Configure Endpoint 0 OUT
    (void)USBDn_EndpointConfigure(ptr_usbd_info, 0x00U, ARM_USB_ENDPOINT_CONTROL, USBD_EP0_MAX_PACKET_SIZE);

    // Configure Endpoint 0 IN
    (void)USBDn_EndpointConfigure(ptr_usbd_info, 0x80U, ARM_USB_ENDPOINT_CONTROL, USBD_EP0_MAX_PACKET_SIZE);

    ptr_usbd_info->ptr_ro_info->ptr_USBD->FADDR = 0U;
    // After reset we consider USB as active
    ptr_usbd_info->ptr_rw_info->usbd_state.active = 1U;
}

// IRQ handler *********************************************************************

NVT_ITCM void HSUSBDn_IRQHandler(const USBD_Info_t *const ptr_usbd_info)
{
    volatile uint32_t u32IntSts, u32BusSts, u32EpIntSts;
    uint32_t u32TimeOutCnt;
    USBD_t *husbd = ptr_usbd_info->ptr_ro_info->ptr_USBD;
    EP_Info_t *ptr_ep;
    uint32_t event = 0;

    u32IntSts = husbd->GINTSTS & husbd->GINTEN;

    if (!u32IntSts)    return;

    //------------------------------------------------------------------
    if (u32IntSts & HSUSBD_GINTSTS_USBIF_Msk)
    {
        // Bus event
        u32BusSts = husbd->BUSINTSTS & husbd->BUSINTEN;

        if (u32BusSts & HSUSBD_BUSINTSTS_SOFIF_Msk)
            husbd->BUSINTSTS = HSUSBD_BUSINTSTS_SOFIF_Msk;

        if (u32BusSts & HSUSBD_BUSINTSTS_RSTIF_Msk)
        {
            USBD_BusReset(ptr_usbd_info);

            ptr_usbd_info->ptr_rw_info->usbd_state.speed = (husbd->OPER & HSUSBD_OPER_CURSPD_Msk) ? ARM_USB_SPEED_HIGH : ARM_USB_SPEED_FULL;

            if (ptr_usbd_info->ptr_rw_info->usbd_state.speed == ARM_USB_SPEED_HIGH)
                event |= ARM_USBD_EVENT_HIGH_SPEED;

            husbd->CEPINTEN = HSUSBD_CEPINTEN_SETUPPKIEN_Msk | HSUSBD_CEPINTEN_STSDONEIEN_Msk;
            husbd->BUSINTEN = (HSUSBD_BUSINTEN_RSTIEN_Msk | HSUSBD_BUSINTEN_RESUMEIEN_Msk | HSUSBD_BUSINTEN_SUSPENDIEN_Msk);
            husbd->BUSINTSTS = HSUSBD_BUSINTSTS_RSTIF_Msk;
            husbd->CEPINTSTS = 0x1ffc;
        }

        if (u32BusSts & HSUSBD_BUSINTSTS_RESUMEIF_Msk)
        {
            husbd->PHYCTL |= (HSUSBD_PHYCTL_PHYEN_Msk | HSUSBD_PHYCTL_DPPUEN_Msk);
            u32TimeOutCnt = SystemCoreClock; /* 1 second time-out */

            while (!(ptr_usbd_info->ptr_ro_info->ptr_USBD->PHYCTL & HSUSBD_PHYCTL_PHYCLKSTB_Msk))
                if (--u32TimeOutCnt == 0) break;

            husbd->BUSINTEN = (HSUSBD_BUSINTEN_RSTIEN_Msk | HSUSBD_BUSINTEN_SUSPENDIEN_Msk);
            husbd->BUSINTSTS = HSUSBD_BUSINTSTS_RESUMEIF_Msk;
            event |= ARM_USBD_EVENT_RESUME;

        }

        if (u32BusSts & HSUSBD_BUSINTSTS_SUSPENDIF_Msk)
        {
            husbd->BUSINTEN = (HSUSBD_BUSINTEN_RSTIEN_Msk | HSUSBD_BUSINTEN_RESUMEIEN_Msk | HSUSBD_BUSINTEN_SUSPENDIEN_Msk);
            husbd->BUSINTSTS = HSUSBD_BUSINTSTS_SUSPENDIF_Msk;
            event |= ARM_USBD_EVENT_SUSPEND;
        }

        if (u32BusSts & HSUSBD_BUSINTSTS_HISPDIF_Msk)
        {
            husbd->CEPINTEN = HSUSBD_CEPINTEN_SETUPPKIEN_Msk;
            husbd->BUSINTSTS = HSUSBD_BUSINTSTS_HISPDIF_Msk;
        }

        if (u32BusSts & HSUSBD_BUSINTSTS_DMADONEIF_Msk)
        {
            husbd->BUSINTSTS = HSUSBD_BUSINTSTS_DMADONEIF_Msk;
        }

        if (u32BusSts & HSUSBD_BUSINTSTS_PHYCLKVLDIF_Msk)
            husbd->BUSINTSTS = HSUSBD_BUSINTSTS_PHYCLKVLDIF_Msk;

        if (u32BusSts & HSUSBD_BUSINTSTS_VBUSDETIF_Msk)
        {
            if (husbd->PHYCTL & HSUSBD_PHYCTL_VBUSDET_Msk)
            {
                // USB Plug In
                husbd->PHYCTL |= (HSUSBD_PHYCTL_PHYEN_Msk | HSUSBD_PHYCTL_DPPUEN_Msk);

                u32TimeOutCnt = SystemCoreClock; /* 1 second time-out */

                while (!(husbd->PHYCTL & HSUSBD_PHYCTL_PHYCLKSTB_Msk))
                    if (--u32TimeOutCnt == 0) break;

                husbd->OPER = HSUSBD_OPER_HISPDEN_Msk;
                husbd->OPER |= HSUSBD_OPER_HISHSEN_Msk;
                event |= ARM_USBD_EVENT_VBUS_ON;
            }
            else
            {
                // USB Un-plug
                husbd->PHYCTL &= ~HSUSBD_PHYCTL_DPPUEN_Msk;
                husbd->OPER &= ~HSUSBD_OPER_HISHSEN_Msk;
                event |= ARM_USBD_EVENT_VBUS_OFF;
            }

            husbd->BUSINTSTS = HSUSBD_BUSINTSTS_VBUSDETIF_Msk;
        }

    }

    if ((ptr_usbd_info->ptr_rw_info->cb_device_event != NULL) && (event != 0U))
    {
        ptr_usbd_info->ptr_rw_info->cb_device_event(event);
    }

    //------------------------------------------------------------------
    // Control endpoint event
    if (u32IntSts & HSUSBD_GINTSTS_CEPIF_Msk)
    {
        u32EpIntSts = husbd->CEPINTSTS & husbd->CEPINTEN;

        if (u32EpIntSts & HSUSBD_CEPINTSTS_SETUPTKIF_Msk)
        {
            husbd->CEPINTSTS = HSUSBD_CEPINTSTS_SETUPTKIF_Msk;
            return;
        }

        if (u32EpIntSts & HSUSBD_CEPINTSTS_SETUPPKIF_Msk)
        {
            husbd->CEPINTSTS = HSUSBD_CEPINTSTS_SETUPPKIF_Msk;
            USBD_SetupStage(ptr_usbd_info);
            return;
        }

        if (u32EpIntSts & HSUSBD_CEPINTSTS_OUTTKIF_Msk)
        {
            husbd->CEPINTSTS = HSUSBD_CEPINTSTS_OUTTKIF_Msk;
            husbd->CEPINTEN = HSUSBD_CEPINTEN_STSDONEIEN_Msk;
            return;
        }

        if (u32EpIntSts & HSUSBD_CEPINTSTS_INTKIF_Msk)
        {
            husbd->CEPINTSTS = HSUSBD_CEPINTSTS_INTKIF_Msk;

