OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USBD/Driver_USBD_HSUSBD.c
            if (!(u32EpIntSts & HSUSBD_CEPINTSTS_STSDONEIF_Msk))
            {
                husbd->CEPINTSTS = HSUSBD_CEPINTSTS_TXPKIF_Msk;

                ptr_ep = &ptr_usbd_info->ptr_rw_info->cep_info[1];

                uint8_t *data_to_transfer = ptr_ep->data + ptr_ep->num_transferred_total;
                uint32_t num_to_transfer  = ptr_ep->num - ptr_ep->num_transferred_total;

                if (num_to_transfer > ptr_ep->max_packet_size)
                {
                    num_to_transfer = ptr_ep->max_packet_size;
                }

                USBD_WriteEpBuffer((uint32_t *)&husbd->CEPDAT, data_to_transfer, num_to_transfer);

                ptr_ep->num_transferred_total += num_to_transfer;

                husbd->CEPINTEN = HSUSBD_CEPINTEN_TXPKIEN_Msk;
                husbd->CEPTXCNT = num_to_transfer;
            }
            else
            {
                husbd->CEPINTSTS = HSUSBD_CEPINTSTS_TXPKIF_Msk;
                husbd->CEPINTEN = (HSUSBD_CEPINTEN_TXPKIEN_Msk | HSUSBD_CEPINTEN_STSDONEIEN_Msk);
            }

            return;
        }

        if (u32EpIntSts & HSUSBD_CEPINTSTS_PINGIF_Msk)
        {
            husbd->CEPINTSTS = HSUSBD_CEPINTSTS_PINGIF_Msk;
            return;
        }

        if (u32EpIntSts & HSUSBD_CEPINTSTS_TXPKIF_Msk)
        {
            ptr_ep = &ptr_usbd_info->ptr_rw_info->cep_info[1];
            husbd->CEPINTSTS = HSUSBD_CEPINTSTS_STSDONEIF_Msk;
            husbd->CEPCTL = HSUSBD_CEPCTL_NAKCLR;

            if (ptr_ep->num_transferred_total != ptr_ep->num)
            {
                husbd->CEPINTSTS = HSUSBD_CEPINTSTS_INTKIF_Msk;
                husbd->CEPINTEN = HSUSBD_CEPINTEN_INTKIEN_Msk;
            }
            else
            {
                ptr_usbd_info->ptr_rw_info->cep_event |= ARM_USBD_EVENT_IN;
                husbd->CEPINTSTS = HSUSBD_CEPINTSTS_STSDONEIF_Msk;
                husbd->CEPINTEN = (HSUSBD_CEPINTEN_SETUPPKIEN_Msk | HSUSBD_CEPINTEN_STSDONEIEN_Msk);
            }

            husbd->CEPINTSTS = HSUSBD_CEPINTSTS_TXPKIF_Msk;
            return;
        }

        if (u32EpIntSts & HSUSBD_CEPINTSTS_RXPKIF_Msk)
        {
            husbd->CEPINTSTS = HSUSBD_CEPINTSTS_RXPKIF_Msk;
            husbd->CEPCTL = HSUSBD_CEPCTL_NAKCLR;
            husbd->CEPINTEN = (HSUSBD_CEPINTEN_SETUPPKIEN_Msk | HSUSBD_CEPINTEN_STSDONEIEN_Msk);
            ptr_usbd_info->ptr_rw_info->cep_event |= ARM_USBD_EVENT_OUT;
            return;
        }

        if (u32EpIntSts & HSUSBD_CEPINTSTS_NAKIF_Msk)
        {
            husbd->CEPINTSTS = HSUSBD_CEPINTSTS_NAKIF_Msk;
            return;
        }

        if (u32EpIntSts & HSUSBD_CEPINTSTS_STALLIF_Msk)
        {
            husbd->CEPINTSTS = HSUSBD_CEPINTSTS_STALLIF_Msk;
            return;
        }

        if (u32EpIntSts & HSUSBD_CEPINTSTS_ERRIF_Msk)
        {
            husbd->CEPINTSTS = HSUSBD_CEPINTSTS_ERRIF_Msk;
            return;
        }

        if (u32EpIntSts & HSUSBD_CEPINTSTS_STSDONEIF_Msk)
        {

            if ((ptr_usbd_info->ptr_rw_info->cb_endpoint_event != NULL) && (ptr_usbd_info->ptr_rw_info->cep_event != 0))
            {
                if ((ptr_usbd_info->ptr_rw_info->cep_event & ARM_USBD_EVENT_IN) && (husbd->CEPINTSTS & HSUSBD_CEPINTSTS_INTKIF_Msk))
                {
                    ptr_usbd_info->ptr_rw_info->cep_event &= ~ARM_USBD_EVENT_IN;
                    ptr_usbd_info->ptr_rw_info->cb_endpoint_event(0x80, ARM_USBD_EVENT_IN);
                }

                if ((ptr_usbd_info->ptr_rw_info->cep_event & ARM_USBD_EVENT_OUT) && (husbd->CEPINTSTS & HSUSBD_CEPINTSTS_OUTTKIF_Msk))
                {
                    ptr_usbd_info->ptr_rw_info->cep_event &= ~ARM_USBD_EVENT_OUT;
                    ptr_usbd_info->ptr_rw_info->cb_endpoint_event(0x00, ARM_USBD_EVENT_OUT);
                }
            }

            husbd->CEPINTSTS = HSUSBD_CEPINTSTS_STSDONEIF_Msk;
            husbd->CEPINTEN = HSUSBD_CEPINTEN_SETUPPKIEN_Msk;
            return;
        }

        if (u32EpIntSts & HSUSBD_CEPINTSTS_BUFFULLIF_Msk)
        {
            husbd->CEPINTSTS = HSUSBD_CEPINTSTS_BUFFULLIF_Msk;
            return;
        }

        if (u32EpIntSts & HSUSBD_CEPINTSTS_BUFEMPTYIF_Msk)
        {
            husbd->CEPINTSTS = HSUSBD_CEPINTSTS_BUFEMPTYIF_Msk;
            return;
        }
    }

    //------------------------------------------------------------------
    // Endpoint event
    if (u32IntSts & \
            (HSUSBD_GINTSTS_EPAIF_Msk | HSUSBD_GINTSTS_EPBIF_Msk | HSUSBD_GINTSTS_EPCIF_Msk | HSUSBD_GINTSTS_EPDIF_Msk | HSUSBD_GINTSTS_EPEIF_Msk | HSUSBD_GINTSTS_EPFIF_Msk | \
             HSUSBD_GINTSTS_EPGIF_Msk | HSUSBD_GINTSTS_EPHIF_Msk | HSUSBD_GINTSTS_EPIIF_Msk | HSUSBD_GINTSTS_EPJIF_Msk | HSUSBD_GINTSTS_EPKIF_Msk | HSUSBD_GINTSTS_EPLIF_Msk | \
             HSUSBD_GINTSTS_EPMIF_Msk | HSUSBD_GINTSTS_EPNIF_Msk | HSUSBD_GINTSTS_EPOIF_Msk | HSUSBD_GINTSTS_EPPIF_Msk | HSUSBD_GINTSTS_EPQIF_Msk | HSUSBD_GINTSTS_EPRIF_Msk))
    {
        EP_Num_t ep_index;
        uint32_t mask;
        USBD_EP_t *ep;

        for (ep_index = PERIPH_EPA, mask = HSUSBD_GINTSTS_EPAIF_Msk, ep = &husbd->EP[PERIPH_EPA]; ep_index < PERIPH_MAX_EP;
                ep_index++, mask <<= 1U, ep++)
        {
            if (u32IntSts & mask)
            {
                uint32_t u32EpIntSts = ep->EPINTSTS & ep->EPINTEN;
                // Clear endpoint event flag
                ep->EPINTSTS = u32EpIntSts;
                uint8_t const ep_addr = ptr_usbd_info->ptr_rw_info->ep_info[ep_index].ep_addr;

                if (EP_DIR(ep_addr))
                {
                    if (u32EpIntSts & HSUSBD_EPINTSTS_BUFEMPTYIF_Msk)
                    {
                        USBD_DataInStage(ptr_usbd_info, ep_addr);
                    }
                    else if (u32EpIntSts & HSUSBD_EPINTSTS_TXPKIF_Msk)
                    {
                        if ((ptr_usbd_info->ptr_rw_info->cb_endpoint_event != NULL))
                        {
                            ptr_usbd_info->ptr_rw_info->cb_endpoint_event(ep_addr, ARM_USBD_EVENT_IN);
                            ep->EPINTEN = 0;
                        }
                    }
                }
                else
                {
                    USBD_DataOutStage(ptr_usbd_info, ep_addr);
                }
            }
        }
    }
}

// End USBD Interface
#if (RTE_USBD1)
NVT_ITCM void HSUSBD_IRQHandler(void)
{
    const USBD_Info_t *ptr_usbd_info = NULL;
    ptr_usbd_info = USBD_GetInfo(HSUSBD);

    if (ptr_usbd_info)
    {
        HSUSBDn_IRQHandler(ptr_usbd_info);
    }
}

#endif
#endif  // DRIVER_CONFIG_VALID

/*! \endcond */
